app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.create(class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["room_number", 0], ["created_at", "2021-02-04 16:40:38.194921"], ["updated_at", "2021-02-04 16:40:38.194921"]]

  def update
    @class = SchoolClass.update(class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "testing"], ["updated_at", "2021-02-04 17:03:48.702533"], ["id", 1]]